let adresses = [
['Замоскворечье', 'Бахрушина', '3', 'Иванов', '30.07.2021'],
['Замоскворечье', 'Бахрушина', '5', 'Иванов', '30.07.2021'],
['Замоскворечье', 'Бахрушина', '7', 'Иванов', '30.07.2021'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023'],
['Замоскворечье', 'Бахрушина', '7', 'Иванов', '30.07.2021'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023'],
['Замоскворечье', 'Бахрушина', '7', 'Иванов', '30.07.2021'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023'],
['Замоскворечье', 'Б. Пионерская', '1', 'Петров', '30.07.2023']
]

let table = document.querySelector(".table");

for (let i = 0; i < adresses.length; i++) {
	let row = document.createElement('div');
	row.classList.add('row')
	for (let k = 0; k < 5; k++) {
		let cell = document.createElement('div');
		cell.textContent = adresses[i][k];
		cell.classList.add('cell');
		row.appendChild(cell);
	}
	table.appendChild(row);
}
